const { fu1, fu2, fu3, fu4, fu5, fu6, fu7, fu8 } = require('../Homework_01')

it('Двузначные и трёхзначные идут последовательно?', () => {
  expect(fu1()).toBe('Да')
})

describe('Первый и последний элемент = 1', () => {
  const expected = [1, 0, 0, 0, 0, 0, 0, 0, 0, 1]
  it('Не совпадает', () => {
    expect(fu2()).toEqual(expected)
  })
})

describe('0 и 1 чередуются, начиная с нуля', () => {
  const expected = [0, 1, 0, 1, 0, 1, 0, 1, 0, 1]
  it('Не совпадает', () => {
    expect(fu3()).toEqual(expected)
  })
})

describe('Заполнить массив последовательными нечетными числами, начиная с единицы.', () => {
  const expected = [1, 3, 5, 7, 9, 11, 13, 15, 17]
  it('Не совпадает', () => {
    expect(fu4()).toEqual(expected)
  })
})

describe('Заполнить массив с шагом в 2 начиная с 0. Длина массива - 10', () => {
  const expected = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18]
  it('Не совпадает', () => {
    expect(fu5()).toEqual(expected)
  })
})

describe('Заполнить массив последовательными нечетными числами, начиная с единицы и до 20', () => {
  const expected = [2, 4, 6, 8, 10, 12, 14, 16, 18, 20]
  it('Не совпадает', () => {
    expect(fu6()).toEqual(expected)
  })
})

describe('Сформировать убывающий массив от 20. Из чисел, которые делятся на 3', () => {
  const expected = [18, 15, 12, 9, 6, 3]
  it('Не совпадает', () => {
    expect(fu7()).toEqual(expected)
  })
})

describe('Создать массив из n первых чисел Фибоначчи до 34', () => {
  const expected = [0, 1, 1, 2, 3, 5, 8, 13, 21, 34]
  it('Не совпадает', () => {
    expect(fu8()).toEqual(expected)
  })
})
